pellepl/baremetal/arch/msp/msp430/mdk/include/legacy.h
#define SYSSNIV_NONE            SYSSNIV__NONE
#define SYSSNIV_ACCTEIFG        SYSSNIV__ACCTEIFG
#define SYSSNIV_CBDIFG          SYSSNIV__CBDIFG
#define SYSSNIV_JMBINIFG        SYSSNIV__JMBINIFG
#define SYSSNIV_JMBOUTIFG       SYSSNIV__JMBOUTIFG
#define SYSSNIV_LEASCCMD        SYSSNIV__LEACMD
#define SYSSNIV_LEASCTO         SYSSNIV__LEATO
#define SYSSNIV_MPUSEG1IFG      SYSSNIV__MPUSEG1IFG
#define SYSSNIV_MPUSEG2IFG      SYSSNIV__MPUSEG2IFG
#define SYSSNIV_MPUSEG3IFG      SYSSNIV__MPUSEG3IFG
#define SYSSNIV_MPUSEGIIFG      SYSSNIV__MPUSEGIIFG
#define SYSSNIV_MPUSEGPIFG      SYSSNIV__MPUSEGPIFG
#define SYSSNIV_SVSLIFG         SYSSNIV__SVSLIFG
#define SYSSNIV_UBDIFG          SYSSNIV__UBDIFG
#define SYSSNIV_VMAIFG          SYSSNIV__VMAIFG
#define SYSSNIV_WPROT           SYSSNIV__WPROT

#define SYSUNIV_NONE            SYSUNIV__NONE
#define SYSUNIV_NMIIFG          SYSUNIV__NMIIFG
#define SYSUNIV_OFIFG           SYSUNIV__OFIFG

#ifdef __MSP430_HAS_LEA__

#define SYSSNIV__LEASCTO        SYSSNIV__LEATO
#define SYSSNIV__LEASCTO_L      SYSSNIV__LEATO_L
#define SYSSNIV__LEASCCMD       SYSSNIV__LEACMD
#define SYSSNIV__LEASCCMD_L     SYSSNIV__LEACMD_L

#endif

#endif

/************************************************************
* Timer A
************************************************************/

#ifdef  __MSP430_HAS_TAx__            /* Definition to show that Module is available */
#define __MSP430_HAS_TxA7__

#define OFS_TAxCTL             OFS_TA0CTL
#define OFS_TAxCCTL0           OFS_TA0CCTL0
#define OFS_TAxCCTL1           OFS_TA0CCTL1
#define OFS_TAxCCTL2           OFS_TA0CCTL2
#define OFS_TAxCCTL3           OFS_TA0CCTL3
#define OFS_TAxCCTL4           OFS_TA0CCTL4
#define OFS_TAxCCTL5           OFS_TA0CCTL5
#define OFS_TAxCCTL6           OFS_TA0CCTL6
#define OFS_TAxR               OFS_TA0R
#define OFS_TAxCCR0            OFS_TA0CCR0
#define OFS_TAxCCR1            OFS_TA0CCR1
#define OFS_TAxCCR2            OFS_TA0CCR2
#define OFS_TAxCCR3            OFS_TA0CCR3
#define OFS_TAxCCR4            OFS_TA0CCR4
#define OFS_TAxCCR5            OFS_TA0CCR5
#define OFS_TAxCCR6            OFS_TA0CCR6
#define OFS_TAxIV              OFS_TA0IV
#define OFS_TAxEX0             OFS_TA0EX0

/* TAxIV Definitions */
#define TAxIV_NONE             (0x0000)       /* No Interrupt pending */
#define TAxIV_TACCR1           (0x0002)       /* TAxCCR1_CCIFG */
#define TAxIV_TACCR2           (0x0004)       /* TAxCCR2_CCIFG */
#define TAxIV_TACCR3           (0x0006)       /* TAxCCR3_CCIFG */
#define TAxIV_TACCR4           (0x0008)       /* TAxCCR4_CCIFG */
#define TAxIV_TACCR5           (0x000A)       /* TAxCCR5_CCIFG */
#define TAxIV_TACCR6           (0x000C)       /* TAxCCR6_CCIFG */
#define TAxIV_TAIFG            (0x000E)       /* TAxIFG */

/* Legacy Defines */
#define TAxIV_TAxCCR1          (0x0002)       /* TAxCCR1_CCIFG */
#define TAxIV_TAxCCR2          (0x0004)       /* TAxCCR2_CCIFG */
#define TAxIV_TAxCCR3          (0x0006)       /* TAxCCR3_CCIFG */
#define TAxIV_TAxCCR4          (0x0008)       /* TAxCCR4_CCIFG */
#define TAxIV_TAxCCR5          (0x000A)       /* TAxCCR5_CCIFG */
#define TAxIV_TAxCCR6          (0x000C)       /* TAxCCR6_CCIFG */
#define TAxIV_TAxIFG           (0x000E)       /* TAxIFG */

#ifndef MC__CONTINOUS
#define MC__CONTINOUS      MC__CONTINUOUS
#endif

#endif

#ifdef __MSP430_HAS_TA0__
#if (__MSP430_HAS_TA0__ == 3)
	#define __MSP430_BASEADDRESS_T0A3__ TA0_BASE
	#define __MSP430_HAS_T0A3__
#endif
#define TIMER_A0_BASE       TA0_BASE

#define TA0IV_TA0CCR1       TAIV__TACCR1
#define TA0IV_TA0CCR2       TAIV__TACCR2
#define TA0IV_TA0IFG        TAIV__TAIFG
#define TA0IV_NONE          TAIV__NONE
#define TA0IV_TACCR1        TAIV__TACCR1
#define TA0IV_TACCR2        TAIV__TACCR2
#define TA0IV_3             TAIV__TACCR3
#define TA0IV_4             TAIV__TACCR4
#define TA0IV_5             TAIV__TACCR5
#define TA0IV_6             TAIV__TACCR6
#define TA0IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA1__
#if (__MSP430_HAS_TA1__ == 3)
	#define __MSP430_BASEADDRESS_T1A3__ TA1_BASE
	#define __MSP430_HAS_T1A3__
#endif
#define TIMER_A1_BASE       TA1_BASE

#define TA1IV_TA1CCR1       TAIV__TACCR1
#define TA1IV_TA1CCR2       TAIV__TACCR2
#define TA1IV_TA1IFG        TAIV__TAIFG
#define TA1IV_NONE          TAIV__NONE
#define TA1IV_TACCR1        TAIV__TACCR1
#define TA1IV_TACCR2        TAIV__TACCR2
#define TA1IV_3             TAIV__TACCR3
#define TA1IV_4             TAIV__TACCR4
#define TA1IV_5             TAIV__TACCR5
#define TA1IV_6             TAIV__TACCR6
#define TA1IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA2__
#if (__MSP430_HAS_TA2__ == 2)
	#define __MSP430_BASEADDRESS_T2A2__ TA2_BASE
	#define __MSP430_HAS_T2A2__
#endif
#define TIMER_A2_BASE       TA2_BASE

#define TA2IV_TA2CCR1       TAIV__TACCR1
#define TA2IV_TA2IFG        TAIV__TAIFG
#define TA2IV_NONE          TAIV__NONE
#define TA2IV_TACCR1        TAIV__TACCR1
#define TA2IV_TACCR2        TAIV__TACCR2
#define TA2IV_3             TAIV__TACCR3
#define TA2IV_4             TAIV__TACCR4
#define TA2IV_5             TAIV__TACCR5
#define TA2IV_6             TAIV__TACCR6
#define TA2IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA3__
#if (__MSP430_HAS_TA3__ == 2)
	#define __MSP430_BASEADDRESS_T3A2__ TA3_BASE
	#define __MSP430_HAS_T3A2__
#endif
#define TIMER_A3_BASE       TA3_BASE

#define TA3IV_TA3CCR1       TAIV__TACCR1
#define TA3IV_TA3IFG        TAIV__TAIFG
#define TA3IV_NONE          TAIV__NONE
#define TA3IV_TACCR1        TAIV__TACCR1
#define TA3IV_TACCR2        TAIV__TACCR2
#define TA3IV_3             TAIV__TACCR3
#define TA3IV_4             TAIV__TACCR4
#define TA3IV_5             TAIV__TACCR5
#define TA3IV_6             TAIV__TACCR6
#define TA3IV_TAIFG         TAIV__TAIFG
#endif

#ifdef __MSP430_HAS_TA4__
#if (__MSP430_HAS_TA4__ == 3)
	#define __MSP430_BASEADDRESS_T4A3__ TA4_BASE
	#define __MSP430_HAS_T4A3__
#endif
#define TIMER_A4_BASE       TA4_BASE

#define TA4IV_TA4CCR1       TAIV__TACCR1
#define TA4IV_TA4IFG        TAIV__TAIFG
#define TA4IV_NONE          TAIV__NONE
#define TA4IV_TACCR1        TAIV__TACCR1
#define TA4IV_TACCR2        TAIV__TACCR2
#define TA4IV_3             TAIV__TACCR3
#define TA4IV_4             TAIV__TACCR4
#define TA4IV_5             TAIV__TACCR5
#define TA4IV_6             TAIV__TACCR6
#define TA4IV_TAIFG         TAIV__TAIFG
#endif

/************************************************************
* Timer B
************************************************************/

#ifdef __MSP430_HAS_TBx__
#define __MSP430_HAS_TxB7__

#define OFS_TBxCTL             OFS_TB0CTL
#define OFS_TBxCCTL0           OFS_TB0CCTL0
#define OFS_TBxCCTL1           OFS_TB0CCTL1
#define OFS_TBxCCTL2           OFS_TB0CCTL2
#define OFS_TBxCCTL3           OFS_TB0CCTL3
#define OFS_TBxCCTL4           OFS_TB0CCTL4
#define OFS_TBxCCTL5           OFS_TB0CCTL5
#define OFS_TBxCCTL6           OFS_TB0CCTL6
#define OFS_TBxR               OFS_TB0R
#define OFS_TBxCCR0            OFS_TB0CCR0
#define OFS_TBxCCR1            OFS_TB0CCR1
#define OFS_TBxCCR2            OFS_TB0CCR2
#define OFS_TBxCCR3            OFS_TB0CCR3
#define OFS_TBxCCR4            OFS_TB0CCR4
#define OFS_TBxCCR5            OFS_TB0CCR5
#define OFS_TBxCCR6            OFS_TB0CCR6
#define OFS_TBxIV              OFS_TB0IV
#define OFS_TBxEX0             OFS_TB0EX0

/* TBxIV Definitions */
#define TBxIV_NONE             (0x0000)       /* No Interrupt pending */
#define TBxIV_TBCCR1           (0x0002)       /* TBxCCR1_CCIFG */
#define TBxIV_TBCCR2           (0x0004)       /* TBxCCR2_CCIFG */
#define TBxIV_TBCCR3           (0x0006)       /* TBxCCR3_CCIFG */
#define TBxIV_TBCCR4           (0x0008)       /* TBxCCR4_CCIFG */
#define TBxIV_TBCCR5           (0x000A)       /* TBxCCR5_CCIFG */
#define TBxIV_TBCCR6           (0x000C)       /* TBxCCR6_CCIFG */
#define TBxIV_TBIFG            (0x000E)       /* TBxIFG */

