pellepl/baremetal/arch/msp/msp430/mdk/include/legacy.h
/* Legacy Defines */
#define TBxIV_TBxCCR1          (0x0002)       /* TBxCCR1_CCIFG */
#define TBxIV_TBxCCR2          (0x0004)       /* TBxCCR2_CCIFG */
#define TBxIV_TBxCCR3          (0x0006)       /* TBxCCR3_CCIFG */
#define TBxIV_TBxCCR4          (0x0008)       /* TBxCCR4_CCIFG */
#define TBxIV_TBxCCR5          (0x000A)       /* TBxCCR5_CCIFG */
#define TBxIV_TBxCCR6          (0x000C)       /* TBxCCR6_CCIFG */
#define TBxIV_TBxIFG           (0x000E)       /* TBxIFG */

#ifndef MC__CONTINOUS
#define MC__CONTINOUS          MC__CONTINUOUS
#endif

#define SHR0                    TBCLGRP0
#define SHR1                    TBCLGRP1
#define SHR_0                   TBCLGRP_0
#define SHR_1                   TBCLGRP_1
#define SHR_2                   TBCLGRP_2
#define SHR_3                   TBCLGRP_3

#define SLSHR0                  CLLD0
#define SLSHR1                  CLLD1
#define SLSHR_0                 CLLD_0
#define SLSHR_1                 CLLD_1
#define SLSHR_2                 CLLD_2
#define SLSHR_3                 CLLD_3

#endif

#ifdef __MSP430_HAS_TB0__
#if (__MSP430_HAS_TB0__ == 3)
    #define __MSP430_BASEADDRESS_T0B3__ TB0_BASE
    #define __MSP430_HAS_T0B3__
#endif
#if (__MSP430_HAS_TB0__ == 7)
    #define __MSP430_BASEADDRESS_T0B7__ TB0_BASE
    #define __MSP430_HAS_T0B7__
#endif
#define TIMER_B0_BASE           TB0_BASE
#define TIMERB0_VECTOR          TIMER0_B0_VECTOR

#define TBCTL                   TB0CTL    /* Control Register */
#define TBCCTL0                 TB0CCTL0  /* Capture/Compare Control 0 */
#define TBCCTL1                 TB0CCTL1  /* Capture/Compare Control 1 */
#define TBCCTL2                 TB0CCTL2  /* Capture/Compare Control 2 */
#define TBCCTL3                 TB0CCTL3  /* Capture/Compare Control 3 */
#define TBCCTL4                 TB0CCTL4  /* Capture/Compare Control 4 */
#define TBCCTL5                 TB0CCTL5  /* Capture/Compare Control 5 */
#define TBCCTL6                 TB0CCTL6  /* Capture/Compare Control 6 */
#define TBR                     TB0R
#define TBCCR0                  TB0CCR0   /* Capture/Compare 0 */
#define TBCCR1                  TB0CCR1   /* Capture/Compare 1 */
#define TBCCR2                  TB0CCR2   /* Capture/Compare 2 */
#define TBCCR3                  TB0CCR3   /* Capture/Compare 3 */
#define TBCCR4                  TB0CCR4   /* Capture/Compare 4 */
#define TBCCR5                  TB0CCR5   /* Capture/Compare 5 */
#define TBCCR6                  TB0CCR6   /* Capture/Compare 6 */
#define TBEX0                   TB0EX0    /* Expansion Register 0 */

#define TBSSEL__TACLK           TBSSEL__TBCLK
    
#define TB0IV_NONE              TBIV__NONE
#define TB0IV_TB0CCR1           TBIV__TBCCR1
#define TB0IV_TB0CCR2           TBIV__TBCCR2
#define TB0IV_TB0CCR3           TBIV__TBCCR3
#define TB0IV_TB0CCR4           TBIV__TBCCR4
#define TB0IV_TB0CCR5           TBIV__TBCCR5
#define TB0IV_TB0CCR6           TBIV__TBCCR6
#define TB0IV_TB0IFG            TBIV__TBIFG

#define TB0IV_TBCCR1            TBIV__TBCCR1
#define TB0IV_TBCCR2            TBIV__TBCCR2
#define TB0IV_TBCCR3            TBIV__TBCCR3
#define TB0IV_TBCCR4            TBIV__TBCCR4
#define TB0IV_TBCCR5            TBIV__TBCCR5
#define TB0IV_TBCCR6            TBIV__TBCCR6
#define TB0IV_TBIFG             TBIV__TBIFG

#endif

#ifdef __MSP430_HAS_TB1__
#if (__MSP430_HAS_TB1__ == 3)
    #define __MSP430_HAS_T1B3__
    #define __MSP430_BASEADDRESS_T1B3__ TB1_BASE
#endif
#define TIMER_B1_BASE           TB1_BASE
#define TIMERB1_VECTOR          TIMER0_B1_VECTOR

#define TB1IV_NONE              TBIV__NONE
#define TB1IV_TB1CCR1           TBIV__TBCCR1
#define TB1IV_TB1CCR2           TBIV__TBCCR2
#define TB1IV_TB1IFG            TBIV__TBIFG
#define TB1IV_TBCCR1            TBIV__TBCCR1
#define TB1IV_TBCCR2            TBIV__TBCCR2
#define TB1IV_TBIFG             TBIV__TBIFG

#endif

/************************************************************
* USCI
************************************************************/

#if defined(__MSP430_HAS_EUSCI_Ax__) || defined(__MSP430_HAS_EUSCI_Bx__)

#define UCADDMASK0              ADDMASK0
#define UCADDMASK0_L            ADDMASK0_L
#define UCADDMASK1              ADDMASK1
#define UCADDMASK1_L            ADDMASK1_L
#define UCADDMASK2              ADDMASK2
#define UCADDMASK2_L            ADDMASK2_L
#define UCADDMASK3              ADDMASK3
#define UCADDMASK3_L            ADDMASK3_L
#define UCADDMASK4              ADDMASK4
#define UCADDMASK4_L            ADDMASK4_L
#define UCADDMASK5              ADDMASK5
#define UCADDMASK5_L            ADDMASK5_L
#define UCADDMASK6              ADDMASK6
#define UCADDMASK6_L            ADDMASK6_L
#define UCADDMASK7              ADDMASK7
#define UCADDMASK7_L            ADDMASK7_L
#define UCADDMASK8              ADDMASK8
#define UCADDMASK8_H            ADDMASK8_H
#define UCADDMASK9              ADDMASK9
#define UCADDMASK9_H            ADDMASK9_H
 
#define UCADDR                  UCADDR_UCIDLE
#define UCIDLE                  UCADDR_UCIDLE
 
#define UCADDRX0                ADDRX0
#define UCADDRX0_L              ADDRX0_L
#define UCADDRX1                ADDRX1
#define UCADDRX1_L              ADDRX1_L
#define UCADDRX2                ADDRX2
#define UCADDRX2_L              ADDRX2_L
#define UCADDRX3                ADDRX3
#define UCADDRX3_L              ADDRX3_L
#define UCADDRX4                ADDRX4
#define UCADDRX4_L              ADDRX4_L
#define UCADDRX5                ADDRX5
#define UCADDRX5_L              ADDRX5_L
#define UCADDRX6                ADDRX6
#define UCADDRX6_L              ADDRX6_L
#define UCADDRX7                ADDRX7
#define UCADDRX7_L              ADDRX7_L
#define UCADDRX8                ADDRX8
#define UCADDRX8_H              ADDRX8_H
#define UCADDRX9                ADDRX9
#define UCADDRX9_H              ADDRX9_H

#define UCBRF_0                 (0x00)         /* USCI First Stage Modulation: 0 */
#define UCBRF_1                 (0x10)         /* USCI First Stage Modulation: 1 */
#define UCBRF_2                 (0x20)         /* USCI First Stage Modulation: 2 */
#define UCBRF_3                 (0x30)         /* USCI First Stage Modulation: 3 */
#define UCBRF_4                 (0x40)         /* USCI First Stage Modulation: 4 */
#define UCBRF_5                 (0x50)         /* USCI First Stage Modulation: 5 */
#define UCBRF_6                 (0x60)         /* USCI First Stage Modulation: 6 */
#define UCBRF_7                 (0x70)         /* USCI First Stage Modulation: 7 */
#define UCBRF_8                 (0x80)         /* USCI First Stage Modulation: 8 */
#define UCBRF_9                 (0x90)         /* USCI First Stage Modulation: 9 */
#define UCBRF_10                (0xA0)         /* USCI First Stage Modulation: A */
#define UCBRF_11                (0xB0)         /* USCI First Stage Modulation: B */
#define UCBRF_12                (0xC0)         /* USCI First Stage Modulation: C */
#define UCBRF_13                (0xD0)         /* USCI First Stage Modulation: D */
#define UCBRF_14                (0xE0)         /* USCI First Stage Modulation: E */
#define UCBRF_15                (0xF0)         /* USCI First Stage Modulation: F */

