pellepl/baremetal/arch/msp/msp430/mdk/include/legacy.h
#define UCOA0                   I2COA00
#define UCOA0_L                 I2COA00_L
#define UCOA1                   I2COA01
#define UCOA1_L                 I2COA01_L
#define UCOA2                   I2COA02
#define UCOA2_L                 I2COA02_L
#define UCOA3                   I2COA03
#define UCOA3_L                 I2COA03_L
#define UCOA4                   I2COA04
#define UCOA4_L                 I2COA04_L
#define UCOA5                   I2COA05
#define UCOA5_L                 I2COA05_L
#define UCOA6                   I2COA06
#define UCOA6_L                 I2COA06_L
#define UCOA7                   I2COA07
#define UCOA7_L                 I2COA07_L
#define UCOA8                   I2COA08
#define UCOA8_H                 I2COA08_H
#define UCOA9                   I2COA09
#define UCOA9_H                 I2COA09_H

#define UCSA0                   I2CSA0
#define UCSA0_L                 I2CSA0_L
#define UCSA1                   I2CSA1
#define UCSA1_L                 I2CSA1_L
#define UCSA2                   I2CSA2
#define UCSA2_L                 I2CSA2_L
#define UCSA3                   I2CSA3
#define UCSA3_L                 I2CSA3_L
#define UCSA4                   I2CSA4
#define UCSA4_L                 I2CSA4_L
#define UCSA5                   I2CSA5
#define UCSA5_L                 I2CSA5_L
#define UCSA6                   I2CSA6
#define UCSA6_L                 I2CSA6_L
#define UCSA7                   I2CSA7
#define UCSA7_L                 I2CSA7_L
#define UCSA8                   I2CSA8
#define UCSA8_H                 I2CSA8_H
#define UCSA9                   I2CSA9
#define UCSA9_H                 I2CSA9_H

#define USCI_NONE               UCIV__NONE
#define USCI_I2C_UCALIFG        UCIV__UCALIFG
#define USCI_I2C_UCBCNTIFG      UCIV__UCBCNTIFG
#define USCI_I2C_UCBIT9IFG      UCIV__UCBIT9IFG
#define USCI_I2C_UCCLTOIFG      UCIV__UCCLTOIFG
#define USCI_I2C_UCNACKIFG      UCIV__UCNACKIFG
#define USCI_I2C_UCRXIFG0       UCIV__UCRXIFG0
#define USCI_I2C_UCRXIFG1       UCIV__UCRXIFG1
#define USCI_I2C_UCRXIFG2       UCIV__UCRXIFG2
#define USCI_I2C_UCRXIFG3       UCIV__UCRXIFG3
#define USCI_I2C_UCSTPIFG       UCIV__UCSTPIFG
#define USCI_I2C_UCSTTIFG       UCIV__UCSTTIFG
#define USCI_I2C_UCTXIFG0       UCIV__UCTXIFG0
#define USCI_I2C_UCTXIFG1       UCIV__UCTXIFG1
#define USCI_I2C_UCTXIFG2       UCIV__UCTXIFG2
#define USCI_I2C_UCTXIFG3       UCIV__UCTXIFG3
#define USCI_SPI_UCRXIFG        UCIV__UCRXIFG
#define USCI_SPI_UCTXIFG        UCIV__UCTXIFG
#define USCI_UART_UCRXIFG       UCIV__UCRXIFG
#define USCI_UART_UCSTTIFG      UCIV__UCSTTIFG
#define USCI_UART_UCTXCPTIFG    UCIV__UCTXCPTIFG
#define USCI_UART_UCTXIFG       UCIV__UCTXIFG

#endif

/************************************************************
* USCI Ax
************************************************************/

#ifdef  __MSP430_HAS_EUSCI_Ax__      /* Definition to show that Module is available */
#define __MSP430_HAS_USCI_Ax__

#define UCAxCTL1               UCA0CTLW0_L
#define UCAxCTL0               UCA0CTLW0_H
#define UCAxBR0                UCA0BRW_L
#define UCAxBR1                UCA0BRW_H
#define UCAxIRTCTL             UCA0IRCTL_L
#define UCAxIRRCTL             UCA0IRCTL_H

#define OFS_UCAxCTLW0          (0x0000)       /* USCI Ax Control Word Register 0 */
#define OFS_UCAxCTLW0_L        OFS_UCAxCTLW0
#define OFS_UCAxCTLW0_H        OFS_UCAxCTLW0+1
#define OFS_UCAxCTL0           (0x0001)
#define OFS_UCAxCTL1           (0x0000)
#define OFS_UCAxCTLW1          (0x0002)       /* USCI Ax Control Word Register 1 */
#define OFS_UCAxCTLW1_L        OFS_UCAxCTLW1
#define OFS_UCAxCTLW1_H        OFS_UCAxCTLW1+1
#define OFS_UCAxBRW            (0x0006)       /* USCI Ax Baud Word Rate 0 */
#define OFS_UCAxBRW_L          OFS_UCAxBRW
#define OFS_UCAxBRW_H          OFS_UCAxBRW+1
#define OFS_UCAxBR0            (0x0006)
#define OFS_UCAxBR1            (0x0007)
#define OFS_UCAxMCTLW          (0x0008)       /* USCI Ax Modulation Control */
#define OFS_UCAxMCTLW_L        OFS_UCAxMCTLW
#define OFS_UCAxMCTLW_H        OFS_UCAxMCTLW+1
#define OFS_UCAxSTATW          (0x000A)       /* USCI Ax Status Register */
#define OFS_UCAxRXBUF          (0x000C)       /* USCI Ax Receive Buffer */
#define OFS_UCAxRXBUF_L        OFS_UCAxRXBUF
#define OFS_UCAxRXBUF_H        OFS_UCAxRXBUF+1
#define OFS_UCAxTXBUF          (0x000E)       /* USCI Ax Transmit Buffer */
#define OFS_UCAxTXBUF_L        OFS_UCAxTXBUF
#define OFS_UCAxTXBUF_H        OFS_UCAxTXBUF+1
#define OFS_UCAxABCTL          (0x0010)       /* USCI Ax LIN Control */
#define OFS_UCAxIRCTL          (0x0012)       /* USCI Ax IrDA Transmit Control */
#define OFS_UCAxIRCTL_L        OFS_UCAxIRCTL
#define OFS_UCAxIRCTL_H        OFS_UCAxIRCTL+1
#define OFS_UCAxIRTCTL         (0x0012)
#define OFS_UCAxIRRCTL         (0x0013)
#define OFS_UCAxIE             (0x001A)       /* USCI Ax Interrupt Enable Register */
#define OFS_UCAxIE_L           OFS_UCAxIE
#define OFS_UCAxIE_H           OFS_UCAxIE+1
#define OFS_UCAxIFG            (0x001C)       /* USCI Ax Interrupt Flags Register */
#define OFS_UCAxIFG_L          OFS_UCAxIFG
#define OFS_UCAxIFG_H          OFS_UCAxIFG+1
#define OFS_UCAxIE__UART       (0x001A)
#define OFS_UCAxIE__UART_L     OFS_UCAxIE__UART
#define OFS_UCAxIE__UART_H     OFS_UCAxIE__UART+1
#define OFS_UCAxIFG__UART      (0x001C)
#define OFS_UCAxIFG__UART_L    OFS_UCAxIFG__UART
#define OFS_UCAxIFG__UART_H    OFS_UCAxIFG__UART+1
#define OFS_UCAxIV             (0x001E)       /* USCI Ax Interrupt Vector Register */

#define OFS_UCAxCTLW0__SPI     (0x0000)
#define OFS_UCAxCTLW0__SPI_L   OFS_UCAxCTLW0__SPI
#define OFS_UCAxCTLW0__SPI_H   OFS_UCAxCTLW0__SPI+1
#define OFS_UCAxCTL0__SPI      (0x0001)
#define OFS_UCAxCTL1__SPI      (0x0000)
#define OFS_UCAxBRW__SPI       (0x0006)
#define OFS_UCAxBRW__SPI_L     OFS_UCAxBRW__SPI
#define OFS_UCAxBRW__SPI_H     OFS_UCAxBRW__SPI+1
#define OFS_UCAxBR0__SPI       (0x0006)
#define OFS_UCAxBR1__SPI       (0x0007)
#define OFS_UCAxSTATW__SPI     (0x000A)
#define OFS_UCAxRXBUF__SPI     (0x000C)
#define OFS_UCAxRXBUF__SPI_L   OFS_UCAxRXBUF__SPI
#define OFS_UCAxRXBUF__SPI_H   OFS_UCAxRXBUF__SPI+1
#define OFS_UCAxTXBUF__SPI     (0x000E)
#define OFS_UCAxTXBUF__SPI_L   OFS_UCAxTXBUF__SPI
#define OFS_UCAxTXBUF__SPI_H   OFS_UCAxTXBUF__SPI+1
#define OFS_UCAxIE__SPI        (0x001A)
#define OFS_UCAxIFG__SPI       (0x001C)
#define OFS_UCAxIV__SPI        (0x001E)

